## We aim in this notebook to identify duplicates in a CSV containing information about restaurants

In [ ]:
!pip3 install nltk

In [11]:
import pandas as pd
import nltk
import time
import numpy as np
nltk.download('punkt')

[nltk_data] Downloading package punkt to /Users/ccompain/nltk_data...
[nltk_data]   Unzipping tokenizers/punkt.zip.

True

In [3]:
df_restaurants = pd.read_csv("./restaurants.csv")

In [4]:
df_restaurants.head(5)

,name,address,city,cuisine,unique_id
0,103 west,103 w. paces ferry rd.,atlanta,continental,675
1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172
2,21 club,21 w. 52nd st.,new york,american,23
3,2223,2223 market st.,san francisco,american,453
4,9 jones street,9 jones st.,new york,american,173

The dataframe contains duplicates records that represent to the same 'real-world' restanrants. The column 'unique_id' was added for this purpose. Two records that are associated with the same attribute value for unique_id represents the same restaurant.

In [5]:
df_restaurants[df_restaurants.unique_id == '23']

        name          address            city          cuisine unique_id
2    21 club   21 w. 52nd st.        new york         american        23
753  21 club   21 w. 52nd st.   new york city   american (new)        23

In the above example, the two records share the same value for attributes 'name' and 'address'. However, they have slightly different values for the columns 'city' and 'cuisine'

In [6]:
df_restaurants[df_restaurants.unique_id == '22']

,name,address,city,cuisine,unique_id
744,yujean kangs gourmet chinese cuisine,67 n. raymond ave.,los angeles,asian,22
864,yujean kangs,67 n. raymond ave.,pasadena,chinese,22

In the above example, on the other hand, the two records are associated with different names, cities and cuisiones.

This file represents a simple example of datasets, on which we can experiment with th etechniques presented in the course to try identify duplicates, without using (that is relying on the values of) the column "unique_id".

In [7]:
# We start by adding a new column to identify the records (lines) in our dataframe
df_restaurants.insert(0,'record_ID', range(0, len(df_restaurants)))

In [8]:
df_restaurants.head(5)

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
1,1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172
2,2,21 club,21 w. 52nd st.,new york,american,23
3,3,2223,2223 market st.,san francisco,american,453
4,4,9 jones street,9 jones st.,new york,american,173

Exhaustive comparisons: every record is compared with every other record

We start by applying an exhaustive strategy whereby every record in the CSV file, is compared with every other record.

The code below does this for us. In doing so, it uses the following rule:

For two records to match, i.e. refer to the same restaurant in the real world:
* The edit distance between the attribute name values of the two records needs to be smaller or equal to 3, and 
* they need to have the same value for the cuisine attribute.

In [9]:
df_restaurants[df_restaurants.record_ID.isin([43, 622])]

,record_ID,name,address,city,cuisine,unique_id
43,43,barbecue kitchen,1437 virginia ave.,atlanta,bbq,678
622,622,shaan,57 w. 48th st.,new york,asian,349

In [12]:
num_records = len(df_restaurants)
matches = []
matchescomplet = []

number_of_matches = 0
tokens1=[]
tokens2=[]
start = time.process_time()
for i in range(0,num_records):
    
    # Après tokenization , calcul du ngrams (n=1) pour le name qui servira pour la Jaccard distance, pour la ligne i
    tokens1name = nltk.word_tokenize(df_restaurants.iloc[i,1]) 
    ng1_tokensname = set(nltk.ngrams(tokens1name, n=1))
    
    # Après tokenization , calcul du ngrams (n=1) pour l'adresse qui servira pour la Jaccard distance,, pour la ligne i
    tokens1adr = nltk.word_tokenize(df_restaurants.iloc[i,2]) 
    ng1_tokensadr = set(nltk.ngrams(tokens1adr, n=1))
    
    
    for j in range(i+1,num_records):
        
        # Après tokenization , calcul du ngrams (n=1) pour le name qui servira pour la Jaccard distance, , pour la ligne j
        tokens2name = nltk.word_tokenize( df_restaurants.iloc[j,1]) 
        ng2_tokensname = set(nltk.ngrams(tokens2name, n=1))
        
        # Après tokenization , calcul du ngrams (n=1) pour le name qui servira pour la Jaccard distance, , pour la ligne j
        tokens2adr = nltk.word_tokenize( df_restaurants.iloc[j,2]) 
        ng2_tokensadr = set(nltk.ngrams(tokens2adr, n=1))
       
        # calcul de la Jaccard distance pour le name entre la ligne i et la ligne j ("item based" avec ngrams (n=1)) 
        jd_ng1_ng2_name = nltk.jaccard_distance(ng1_tokensname, ng2_tokensname)  # jaccard distance entre les ngram=1 des names
        
        # calcul de la Jaccard distance pour l'adresse entre la ligne i et la ligne j ("item based" avec ngrams (n=1)) 
        jd_ng1_ng2_adr = nltk.jaccard_distance(ng1_tokensadr, ng2_tokensadr)  # jaccard distance entre les ngram=1 des adresses
    
        # Rule for matching: 
        # disjonction entre une similarité entre les names (name_score<=1) 
        # et une similarité conjugée entre les adresses et les noms (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6)
        name_score = nltk.edit_distance(df_restaurants.iloc[i,1], df_restaurants.iloc[j,1])
        
        # Rule for matching: Distance between names is smaller or equal to 3 and the cuisine is the same 
        if (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) or name_score<=1 :
            number_of_matches = number_of_matches +1 
            # matchescomplet.append((df_restaurants.iloc[i,0],df_restaurants.iloc[i,1], df_restaurants.iloc[i,2],df_restaurants.iloc[i,5], df_restaurants.iloc[j,0],df_restaurants.iloc[j,1], df_restaurants.iloc[j,2],df_restaurants.iloc[j,5]))
            matches.append((df_restaurants.iloc[i,0],df_restaurants.iloc[j,0]))

end = time.process_time()

print("Number of matches: {}".format(number_of_matches))
print("Processing time: {}".format(end - start))
for _ in matchescomplet:
     print(_)

Number of matches: 127
Processing time: 153.38521500000002

In [13]:
# quelques tests pour ajuster les critères de notre algorithme
name_score = nltk.edit_distance(df_restaurants.iloc[73,1], df_restaurants.iloc[763,1])
name_score   # 11
# comme on le voit ci-dessous, la différence est le mot "restaurant", l'edit distance est très importante (11), 
# on ne peut pas se baser dessus pour dire que c le même resto, il faut qu'on ajoute un critère "item based" 
# en plus du critère edit_distance name_score<=1

11

In [14]:
# qq tests pour ajuster les critères de notre alogorithme
df_restaurants[df_restaurants.record_ID.isin([73, 763])]

,record_ID,name,address,city,cuisine,unique_id
73,73,bones,3130 piedmont road,atlanta,american,76
763,763,bones restaurant,3130 piedmont rd. ne,atlanta,steakhouses,76

In [15]:
# name_score = nltk.edit_distance(df_restaurants.iloc[32,1], df_restaurants.iloc[759,1])
#print(name_score)
tokens1 = nltk.word_tokenize(df_restaurants.iloc[73,1]) 
tokens2 = nltk.word_tokenize( df_restaurants.iloc[763,1]) 
print(tokens1)
print(tokens2)
ng1_tokens = set(nltk.ngrams(tokens1, n=1))
ng2_tokens = set(nltk.ngrams(tokens2, n=1))
print(ng1_tokens)
print(ng2_tokens)

jd_sent_1_2 = nltk.jaccard_distance(ng1_tokens, ng2_tokens)
print(jd_sent_1_2)
# jd_ng1_ng2_adr <= 0.6,ce seuil de 0.6 suffira dire que les lignes 32 et 759 sont le même restaurant

['bones']
['bones', 'restaurant']
{('bones',)}
{('bones',), ('restaurant',)}
0.5

In [16]:
# adresse
#print(name_score)
tokens1 = nltk.word_tokenize(df_restaurants.iloc[73,2]) 
tokens2 = nltk.word_tokenize( df_restaurants.iloc[763,2]) 
print(tokens1)
print(tokens2)
ng1_tokens = set(nltk.ngrams(tokens1, n=1))
ng2_tokens = set(nltk.ngrams(tokens2, n=1))
print(ng1_tokens)
print(ng2_tokens)

jd_sent_1_2 = nltk.jaccard_distance(ng1_tokens, ng2_tokens)
print(jd_sent_1_2)
# ça ne passe pas , mais c pas grave car mettre le seuil à 0.67 va nous rajouter beaucoup de faux positifs 
# on a testé ce seuil plus élevé de 0.67

['3130', 'piedmont', 'road']
['3130', 'piedmont', 'rd', '.', 'ne']
{('road',), ('piedmont',), ('3130',)}
{('ne',), ('.',), ('rd',), ('piedmont',), ('3130',)}
0.6666666666666666

In [17]:
name_score = nltk.edit_distance(df_restaurants.iloc[6,1], df_restaurants.iloc[754,1])
name_score

0

In [18]:
# name_score = nltk.edit_distance(df_restaurants.iloc[32,1], df_restaurants.iloc[759,1])
#print(name_score)
tokens1 = nltk.word_tokenize(df_restaurants.iloc[6,1]) 
tokens2 = nltk.word_tokenize( df_restaurants.iloc[754,1]) 
print(tokens1)
print(tokens2)
ng1_tokens = set(nltk.ngrams(tokens1, n=1))
ng2_tokens = set(nltk.ngrams(tokens2, n=1))
print(ng1_tokens)
print(ng2_tokens)

jd_sent_1_2 = nltk.jaccard_distance(ng1_tokens, ng2_tokens)
print(jd_sent_1_2)

['abruzzi']
['abruzzi']
{('abruzzi',)}
{('abruzzi',)}
0.0

In [19]:
name_score = nltk.edit_distance(df_restaurants.iloc[6,1], df_restaurants.iloc[754,1])
name_score

0

In [20]:
# name_score = nltk.edit_distance(df_restaurants.iloc[32,1], df_restaurants.iloc[759,1])
#print(name_score)
tokens1 = nltk.word_tokenize(df_restaurants.iloc[32,1]) 
tokens2 = nltk.word_tokenize( df_restaurants.iloc[759,1]) 
print(tokens1)
print(tokens2)
ng1_tokens = set(nltk.ngrams(tokens1, n=1))
ng2_tokens = set(nltk.ngrams(tokens2, n=1))
print(ng1_tokens)
print(ng2_tokens)

jd_sent_1_2 = nltk.jaccard_distance(ng1_tokens, ng2_tokens)
print(jd_sent_1_2)

['arts', 'delicatessen']
['arts', 'deli']
{('arts',), ('delicatessen',)}
{('deli',), ('arts',)}
0.6666666666666666

In [21]:
# Display results
for match in matches:
    print("The following records {} and {} match".format(match[0],match[1]))
    print("The restaurants with the following names {} and {} match.".format(df_restaurants.iloc[match[0],1],df_restaurants.iloc[match[1],1]))
    print("The restaurants with the following addresses {} and {} match.".format(df_restaurants.iloc[match[0],2],df_restaurants.iloc[match[1],2]))
    print("\n")

The following records 2 and 753 match
The restaurants with the following names 21 club and 21 club match.
The restaurants with the following addresses  21 w. 52nd st. and  21 w. 52nd st. match.


The following records 6 and 754 match
The restaurants with the following names abruzzi and abruzzi match.
The restaurants with the following addresses  2355 peachtree rd.  peachtree battle shopping center and  2355 peachtree rd. ne match.


The following records 13 and 755 match
The restaurants with the following names alain rondelli and alain rondelli match.
The restaurants with the following addresses  126 clement st. and  126 clement st. match.


The following records 26 and 756 match
The restaurants with the following names aquavit and aquavit match.
The restaurants with the following addresses  13 w. 54th st. and  13 w. 54th st. match.


The following records 27 and 757 match
The restaurants with the following names aqua and aqua match.
The restaurants with the following addresses  252 california st. and  252 california st. match.


The following records 30 and 758 match
The restaurants with the following names arnie mortons of chicago and arnie mortons of chicago match.
The restaurants with the following addresses  435 s. la cienega blv. and  435 s. la cienega blvd. match.


The following records 36 and 760 match
The restaurants with the following names aureole and aureole match.
The restaurants with the following addresses  34 e. 61st st. and  34 e. 61st st. match.


The following records 37 and 761 match
The restaurants with the following names bacchanalia and bacchanalia match.
The restaurants with the following addresses  3125 piedmont rd.  near peachtree rd. and  3125 piedmont rd. match.


The following records 55 and 56 match
The restaurants with the following names bertolinis and bertolinis match.
The restaurants with the following addresses  3500 peachtree rd.  phipps plaza and  3570 las vegas blvd. s match.


The following records 76 and 764 match
The restaurants with the following names boulevard and boulevard match.
The restaurants with the following addresses  1 mission st. and  1 mission st. match.


The following records 79 and 765 match
The restaurants with the following names brasserie le coze and brasserie le coze match.
The restaurants with the following addresses  3393 peachtree rd.  lenox square mall  near neiman marcus and  3393 peachtree rd. match.


The following records 87 and 88 match
The restaurants with the following names bruno and brunos match.
The restaurants with the following addresses  240 e. 58th st. and  3838 centinela ave. match.


The following records 92 and 766 match
The restaurants with the following names buckhead diner and buckhead diner match.
The restaurants with the following addresses  3073 piedmont road and  3073 piedmont rd. match.


The following records 95 and 180 match
The restaurants with the following names c3 and ct match.
The restaurants with the following addresses  103 waverly pl.  near washington sq. and  111 e. 22nd st.  between park ave. s and lexington ave. match.


The following records 96 and 196 match
The restaurants with the following names cafe  ritz-carlton  buckhead and dining room  ritz-carlton  buckhead match.
The restaurants with the following addresses  3434 peachtree rd. and  3434 peachtree rd. match.


The following records 96 and 841 match
The restaurants with the following names cafe  ritz-carlton  buckhead and ritz-carlton cafe (buckhead) match.
The restaurants with the following addresses  3434 peachtree rd. and  3434 peachtree rd. ne match.


The following records 99 and 767 match
The restaurants with the following names cafe bizou and cafe bizou match.
The restaurants with the following addresses  14016 ventura blvd. and  14016 ventura blvd. match.


The following records 103 and 768 match
The restaurants with the following names cafe claude and cafe claude match.
The restaurants with the following addresses  7 claude la. and  7 claude ln. match.


The following records 105 and 769 match
The restaurants with the following names cafe des artistes and cafe des artistes match.
The restaurants with the following addresses  1 w. 67th st. and  1 w. 67th st. match.


The following records 109 and 770 match
The restaurants with the following names cafe lalo and cafe lalo match.
The restaurants with the following addresses  201 w. 83rd st. and  201 w. 83rd st. match.


The following records 116 and 125 match
The restaurants with the following names cafe roma and caffe roma match.
The restaurants with the following addresses  3570 las vegas blvd. s and  385 broome st. at mulberry match.


The following records 130 and 771 match
The restaurants with the following names campanile and campanile match.
The restaurants with the following addresses  624 s. la brea ave. and  624 s. la brea ave. match.


The following records 132 and 772 match
The restaurants with the following names campton place and campton place match.
The restaurants with the following addresses  340 stockton st. and  340 stockton st. match.


The following records 141 and 773 match
The restaurants with the following names carmines and carmines match.
The restaurants with the following addresses  2450 broadway  between 90th and 91st sts. and  2450 broadway match.


The following records 142 and 774 match
The restaurants with the following names carnegie deli and carnegie deli match.
The restaurants with the following addresses  854 7th ave.  between 54th and 55th sts. and  854 seventh ave. match.


The following records 148 and 490 match
The restaurants with the following names cava and nava match.
The restaurants with the following addresses  3rd st. and  3060 peachtree rd. match.


The following records 153 and 154 match
The restaurants with the following names cha cha cha and cha cha chas match.
The restaurants with the following addresses  656 n. virgil ave. and  1805 haight st. match.


The following records 156 and 775 match
The restaurants with the following names chanterelle and chanterelle match.
The restaurants with the following addresses  2 harrison st.  near hudson st. and  2 harrison st. match.


The following records 160 and 776 match
The restaurants with the following names chez michel and chez michel match.
The restaurants with the following addresses  804 northpoint and  804 north point st. match.


The following records 163 and 614 match
The restaurants with the following names chinois on main and schatzi on main match.
The restaurants with the following addresses  2709 main st. and  3110 main st. match.


The following records 163 and 777 match
The restaurants with the following names chinois on main and chinois on main match.
The restaurants with the following addresses  2709 main st. and  2709 main st. match.


The following records 164 and 778 match
The restaurants with the following names chins and chins match.
The restaurants with the following addresses  3200 las vegas blvd. s and  3200 las vegas blvd. s. match.


The following records 167 and 779 match
The restaurants with the following names ciboulette and ciboulette restaurant match.
The restaurants with the following addresses  1529 piedmont ave. and  1529 piedmont ave. match.


The following records 170 and 780 match
The restaurants with the following names citrus and citrus match.
The restaurants with the following addresses  6703 melrose ave. and  6703 melrose ave. match.


The following records 186 and 782 match
The restaurants with the following names daniel and daniel match.
The restaurants with the following addresses  20 e. 76th st. and  20 e. 76th st. match.


The following records 190 and 783 match
The restaurants with the following names dawat and dawat match.
The restaurants with the following addresses  210 e. 58th st. and  210 e. 58th st. match.


The following records 193 and 784 match
The restaurants with the following names delectables and delectables match.
The restaurants with the following addresses  1 margaret mitchell sq. and  1 margaret mitchell sq. match.


The following records 196 and 842 match
The restaurants with the following names dining room  ritz-carlton  buckhead and ritz-carlton dining room (buckhead) match.
The restaurants with the following addresses  3434 peachtree rd. and  3434 peachtree rd. ne match.


The following records 233 and 785 match
The restaurants with the following names felidia and felidia match.
The restaurants with the following addresses  243 e. 58th st. and  243 e. 58th st. match.


The following records 234 and 235 match
The restaurants with the following names felix and fenix match.
The restaurants with the following addresses  340 w. broadway at grand st. and  8358 sunset blvd. west match.


The following records 245 and 787 match
The restaurants with the following names fleur de lys and fleur de lys match.
The restaurants with the following addresses  777 sutter st. and  777 sutter st. match.


The following records 250 and 788 match
The restaurants with the following names four seasons grill room and four seasons match.
The restaurants with the following addresses  99 e. 52nd st. and  99 e. 52nd st. match.


The following records 257 and 789 match
The restaurants with the following names fringale and fringale match.
The restaurants with the following addresses  570 4th st. and  570 fourth st. match.


The following records 264 and 790 match
The restaurants with the following names georgia grille and georgia grille match.
The restaurants with the following addresses  2290 peachtree rd.  peachtree square shopping center and  2290 peachtree rd. match.


The following records 274 and 791 match
The restaurants with the following names gotham bar & grill and gotham bar & grill match.
The restaurants with the following addresses  12 e. 12th st. and  12 e. 12th st. match.


The following records 275 and 792 match
The restaurants with the following names gramercy tavern and gramercy tavern match.
The restaurants with the following addresses  42 e. 20th st.  between park ave. s and broadway and  42 e. 20th st. match.


The following records 278 and 793 match
The restaurants with the following names granita and granita match.
The restaurants with the following addresses  23725 w. malibu rd. and  23725 w. malibu rd. match.


The following records 282 and 794 match
The restaurants with the following names grill on the alley and grill  the match.
The restaurants with the following addresses  9560 dayton way and  9560 dayton way match.


The following records 287 and 288 match
The restaurants with the following names hard rock cafe and hard rock cafe match.
The restaurants with the following addresses  8600 beverly blvd. and  221 w. 57th st. match.


The following records 294 and 795 match
The restaurants with the following names hawthorne lane and hawthorne lane match.
The restaurants with the following addresses  22 hawthorne st. and  22 hawthorne st. match.


The following records 296 and 796 match
The restaurants with the following names hedgerose heights inn and hedgerose heights inn  the match.
The restaurants with the following addresses  490 e. paces ferry rd. and  490 e. paces ferry rd. ne match.


The following records 297 and 797 match
The restaurants with the following names heera of india and heera of india match.
The restaurants with the following addresses  595 piedmont ave.  rio shopping mall and  595 piedmont ave. match.


The following records 306 and 762 match
The restaurants with the following names hotel bel-air and bel-air hotel match.
The restaurants with the following addresses  701 stone canyon rd. and  701 stone canyon rd. match.


The following records 321 and 798 match
The restaurants with the following names indigo coastal grill and indigo coastal grill match.
The restaurants with the following addresses  1397 n. highland ave. and  1397 n. highland ave. match.


The following records 326 and 799 match
The restaurants with the following names island spice and island spice match.
The restaurants with the following addresses  402 w. 44th st. and  402 w. 44th st. match.


The following records 339 and 800 match
The restaurants with the following names jo jo and jo jo match.
The restaurants with the following addresses  160 e. 64th st. and  160 e. 64th st. match.


The following records 343 and 350 match
The restaurants with the following names joes and joss match.
The restaurants with the following addresses  1023 abbot kinney blvd. and  9255 sunset blvd. match.


The following records 358 and 802 match
The restaurants with the following names khan toke thai house and khan toke thai house match.
The restaurants with the following addresses  5937 geary blvd. and  5937 geary blvd. match.


The following records 367 and 803 match
The restaurants with the following names la caravelle and la caravelle match.
The restaurants with the following addresses  33 w. 55th st. and  33 w. 55th st. match.


The following records 369 and 804 match
The restaurants with the following names la cote basque and la cote basque match.
The restaurants with the following addresses  60 w. 55th st.  between 5th and 6th ave. and  60 w. 55th st. match.


The following records 371 and 805 match
The restaurants with the following names la folie and la folie match.
The restaurants with the following addresses  2316 polk st. and  2316 polk st. match.


The following records 375 and 806 match
The restaurants with the following names la grotta and la grotta match.
The restaurants with the following addresses  2637 peachtree rd.  peachtree house condominium and  2637 peachtree rd. ne match.


The following records 385 and 807 match
The restaurants with the following names le bernardin and le bernardin match.
The restaurants with the following addresses  155 w. 51st st. and  155 w. 51st st. match.


The following records 389 and 390 match
The restaurants with the following names le colonial and le colonial match.
The restaurants with the following addresses  8783 beverly blvd. and  149 e. 57th st. match.


The following records 396 and 809 match
The restaurants with the following names le montrachet and le montrachet bistro match.
The restaurants with the following addresses  3000 w. paradise rd. and  3000 paradise rd. match.


The following records 401 and 810 match
The restaurants with the following names les celebrites and les celebrites match.
The restaurants with the following addresses  160 central park s and  155 w. 58th st. match.


The following records 409 and 812 match
The restaurants with the following names locanda veneta and locanda veneta match.
The restaurants with the following addresses  3rd st. and  8638 w. third st. match.


The following records 415 and 813 match
The restaurants with the following names lulu and lulu restaurant-bis-cafe match.
The restaurants with the following addresses  816 folsom st. and  816 folsom st. match.


The following records 417 and 814 match
The restaurants with the following names lutece and lutece match.
The restaurants with the following addresses  249 e. 50th st. and  249 e. 50th st. match.


The following records 421 and 815 match
The restaurants with the following names lorangerie and lorangerie match.
The restaurants with the following addresses  903 n. la cienega blvd. and  903 n. la cienega blvd. match.


The following records 434 and 816 match
The restaurants with the following names manhattan ocean club and manhattan ocean club match.
The restaurants with the following addresses  57 w. 58th st. and  57 w. 58th st. match.


The following records 438 and 449 match
The restaurants with the following names march and match match.
The restaurants with the following addresses  405 e. 58th st. and  160 mercer st.  between houston and prince sts. match.


The following records 438 and 817 match
The restaurants with the following names march and march match.
The restaurants with the following addresses  405 e. 58th st. and  405 e. 58th st. match.


The following records 446 and 818 match
The restaurants with the following names mary macs tea room and mary macs tea room match.
The restaurants with the following addresses  224 ponce de leon ave. and  224 ponce de leon ave. match.


The following records 448 and 819 match
The restaurants with the following names masas and masas match.
The restaurants with the following addresses  648 bush st. and  648 bush st. match.


The following records 449 and 817 match
The restaurants with the following names match and march match.
The restaurants with the following addresses  160 mercer st.  between houston and prince sts. and  405 e. 58th st. match.


The following records 450 and 820 match
The restaurants with the following names matsuhisa and matsuhisa match.
The restaurants with the following addresses  129 n. la cienega blvd. and  129 n. la cienega blvd. match.


The following records 460 and 821 match
The restaurants with the following names mesa grill and mesa grill match.
The restaurants with the following addresses  102 5th ave.  between 15th and 16th sts. and  102 fifth ave. match.


The following records 461 and 822 match
The restaurants with the following names mi cocina and mi cocina match.
The restaurants with the following addresses  57 jane st.  off hudson st. and  57 jane st. match.


The following records 463 and 481 match
The restaurants with the following names michaels (las vegas) and mortons of chicago (las vegas) match.
The restaurants with the following addresses  3595 las vegas blvd. s. and  3200 las vegas blvd. s. match.


The following records 463 and 635 match
The restaurants with the following names michaels (las vegas) and spago (las vegas) match.
The restaurants with the following addresses  3595 las vegas blvd. s. and  3500 las vegas blvd. s. match.


The following records 463 and 781 match
The restaurants with the following names michaels (las vegas) and coyote cafe (las vegas) match.
The restaurants with the following addresses  3595 las vegas blvd. s. and  3799 las vegas blvd. s. match.


The following records 477 and 824 match
The restaurants with the following names montrachet and montrachet match.
The restaurants with the following addresses  239 w. broadway  between walker and white sts. and  239 w. broadway match.


The following records 481 and 635 match
The restaurants with the following names mortons of chicago (las vegas) and spago (las vegas) match.
The restaurants with the following addresses  3200 las vegas blvd. s. and  3500 las vegas blvd. s. match.


The following records 481 and 781 match
The restaurants with the following names mortons of chicago (las vegas) and coyote cafe (las vegas) match.
The restaurants with the following addresses  3200 las vegas blvd. s. and  3799 las vegas blvd. s. match.


The following records 482 and 483 match
The restaurants with the following names mortons and mortons match.
The restaurants with the following addresses  8764 melrose ave. and  551 5th ave. at 45th st. match.


The following records 497 and 825 match
The restaurants with the following names nikolais roof and nikolais roof match.
The restaurants with the following addresses  255 courtland st.  at harris st. and  255 courtland st. match.


The following records 504 and 826 match
The restaurants with the following names oceana and oceana match.
The restaurants with the following addresses  55 e. 54th st. and  55 e. 54th st. match.


The following records 519 and 827 match
The restaurants with the following names palace court and palace court match.
The restaurants with the following addresses  3570 las vegas blvd. s and  3570 las vegas blvd. s. match.


The following records 524 and 525 match
The restaurants with the following names palm too and palm match.
The restaurants with the following addresses  840 second ave. and  837 second ave. match.


The following records 529 and 829 match
The restaurants with the following names panos and pauls and panos & pauls match.

Note that the rule applied in the above code is not great. You may want to try other kind of distances, other thresholds, and other rules to identify matches.

# Assessing the quality of the results

To do so, we first need to compute the ground truth (that is the list of correct matches) considering the attribute unique_id.

In [22]:
ground_truth_matches = pd.read_csv("./restaurants.csv")

In [23]:
ground_truth_matches.insert(0, 'record_ID', range(0, len(ground_truth_matches)))

In [24]:
ground_truth_matches.head(5)

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
1,1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172
2,2,21 club,21 w. 52nd st.,new york,american,23
3,3,2223,2223 market st.,san francisco,american,453
4,4,9 jones street,9 jones st.,new york,american,173

In [25]:
ground_truth_matches = pd.merge(ground_truth_matches,
                                ground_truth_matches,
                                on = 'unique_id')

In [26]:
ground_truth_matches.head(5)

,record_ID_x,name_x,address_x,city_x,cuisine_x,unique_id,record_ID_y,name_y,address_y,city_y,cuisine_y
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675,0,103 west,103 w. paces ferry rd.,atlanta,continental
1,1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172,1,20 mott,20 mott st. between bowery and pell st.,new york,asian
2,2,21 club,21 w. 52nd st.,new york,american,23,2,21 club,21 w. 52nd st.,new york,american
3,2,21 club,21 w. 52nd st.,new york,american,23,753,21 club,21 w. 52nd st.,new york city,american (new)
4,753,21 club,21 w. 52nd st.,new york city,american (new),23,2,21 club,21 w. 52nd st.,new york,american

In [27]:
len(ground_truth_matches)

1089

In [28]:
ground_truth_matches = ground_truth_matches.query('record_ID_x < record_ID_y')

In [29]:
ground_truth_matches.head(20)

,record_ID_x,name_x,address_x,city_x,cuisine_x,unique_id,record_ID_y,name_y,address_y,city_y,cuisine_y
3,2,21 club,21 w. 52nd st.,new york,american,23,753,21 club,21 w. 52nd st.,new york city,american (new)
10,6,abruzzi,2355 peachtree rd. peachtree battle shopping...,atlanta,italian,74,754,abruzzi,2355 peachtree rd. ne,atlanta,italian
20,13,alain rondelli,126 clement st.,san francisco,french,94,755,alain rondelli,126 clement st.,san francisco,french (new)
36,26,aquavit,13 w. 54th st.,new york,continental,24,756,aquavit,13 w. 54th st.,new york city,scandinavian
40,27,aqua,252 california st.,san francisco,seafood,95,757,aqua,252 california st.,san francisco,american (new)
46,30,arnie mortons of chicago,435 s. la cienega blv.,los angeles,american,0,758,arnie mortons of chicago,435 s. la cienega blvd.,los angeles,steakhouses
51,32,arts delicatessen,12224 ventura blvd.,studio city,american,1,759,arts deli,12224 ventura blvd.,studio city,delis
58,36,aureole,34 e. 61st st.,new york,american,25,760,aureole,34 e. 61st st.,new york city,american (new)
62,37,bacchanalia,3125 piedmont rd. near peachtree rd.,atlanta,international,75,761,bacchanalia,3125 piedmont rd.,atlanta,californian
101,73,bones,3130 piedmont road,atlanta,american,76,763,bones restaurant,3130 piedmont rd. ne,atlanta,steakhouses
107,76,boulevard,1 mission st.,san francisco,american,96,764,boulevard,1 mission st.,san francisco,american (new)
113,79,brasserie le coze,3393 peachtree rd. lenox square mall near n...,atlanta,french,77,765,brasserie le coze,3393 peachtree rd.,atlanta,french bistro
129,92,buckhead diner,3073 piedmont road,atlanta,american,78,766,buckhead diner,3073 piedmont rd.,atlanta,american (new)
136,96,cafe ritz-carlton buckhead,3434 peachtree rd.,atlanta,ext 6108 international,89,841,ritz-carlton cafe (buckhead),3434 peachtree rd. ne,atlanta,american (new)
142,99,cafe bizou,14016 ventura blvd.,sherman oaks,french,3,767,cafe bizou,14016 ventura blvd.,sherman oaks,french bistro
149,103,cafe claude,7 claude la.,san francisco,french,97,768,cafe claude,7 claude ln.,san francisco,french bistro
154,105,cafe des artistes,1 w. 67th st.,new york,continental,27,769,cafe des artistes,1 w. 67th st.,new york city,french (classic)
161,109,cafe lalo,201 w. 83rd st.,new york,coffee bar,26,770,cafe lalo,201 w. 83rd st.,new york city,coffeehouses
185,130,campanile,624 s. la brea ave.,los angeles,american,4,771,campanile,624 s. la brea ave.,los angeles,californian
190,132,campton place,340 stockton st.,san francisco,american,98,772,campton place,340 stockton st.,san francisco,american (new)

In [30]:
ground_truth_matches = ground_truth_matches[['record_ID_x','record_ID_y']]

In [31]:
print(ground_truth_matches)

      record_ID_x  record_ID_y
3               2          753
10              6          754
20             13          755
36             26          756
40             27          757
...           ...          ...
1030          708          860
1034          709          861
1041          713          862
1053          722          863
1078          744          864

[112 rows x 2 columns]

In [32]:
print(len(ground_truth_matches))

112

In [33]:
print(len(matches))

127

In [34]:
matches_df = pd.DataFrame(matches)
matches_df.head(5)

    0    1
0   2  753
1   6  754
2  13  755
3  26  756
4  27  757

In [35]:
matches_df = pd.DataFrame(matches)
matches_df.columns= ['record_ID_x','record_ID_y']

In [36]:
# on s'assure que les couples record_ID_x et record_ID_y sont dans le bons sens (record_ID_x < record_ID_y)
# comme dans ground_truth
matches_df[matches_df['record_ID_x'] >= matches_df['record_ID_y'] ]
# 0 lignes trouvées , donc c OK.

Empty DataFrame
Columns: [record_ID_x, record_ID_y]
Index: []

In [37]:
matches_df.head()

   record_ID_x  record_ID_y
0            2          753
1            6          754
2           13          755
3           26          756
4           27          757

In [38]:
diff_df = pd.merge(ground_truth_matches, matches_df, how='outer', indicator='Exist')

In [39]:
diff_df.head(5)

   record_ID_x  record_ID_y Exist
0            2          753  both
1            6          754  both
2           13          755  both
3           26          756  both
4           27          757  both

In [40]:
true_positives = diff_df[diff_df.Exist=='both']
false_positives = diff_df[diff_df.Exist=='right_only']
false_negatives = diff_df[diff_df.Exist=='left_only']

In [41]:
# les vrais duplicats que notre algo a pu détecter
true_positives.head()

   record_ID_x  record_ID_y Exist
0            2          753  both
1            6          754  both
2           13          755  both
3           26          756  both
4           27          757  both

In [42]:
#Example of a true positive
df_restaurants[df_restaurants.record_ID.isin(['6','754'])]

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [43]:
# notre algo les a sortis comme restos en double mais c pas vrai
false_positives.head()

     record_ID_x  record_ID_y       Exist
112           55           56  right_only
113           87           88  right_only
114           95          180  right_only
115           96          196  right_only
116          116          125  right_only

In [44]:
# notre critère de duplicate :
# (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) or (name_score<=1 and jd_ng1_ng2_adr <= 0.6) 
# eliminer grace jd_ng1_ng2_adr = 0.6666
df_restaurants[df_restaurants.record_ID.isin(['55','56'])]
# le name est le même donc l'algo dit que ce le même restaurant alors que ce n'est pas vrai.

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [45]:
# pareil c pas le même resto alors que l'algo les a retenu comme duplicate
# car les names diffèrent d'un seul caractère.
df_restaurants[df_restaurants.record_ID.isin(['87','88'])]

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [46]:
# name_score<=1
name_score = nltk.edit_distance(df_restaurants.iloc[87,1], df_restaurants.iloc[88,1])
name_score

1

In [47]:
# les vrais duplicates que l'algo n'a pas détecté
false_negatives.head()

    record_ID_x  record_ID_y      Exist
6            32          759  left_only
9            73          763  left_only
28          179          781  left_only
34          235          786  left_only
56          388          808  left_only

In [48]:
df_restaurants[df_restaurants.record_ID.isin(['32','759'])]

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [49]:
# faux négatif
# pour l'algo le 32 et le 759 c'est pas le même restaurant, pourtant c le même
# en effet les names diffèrents en lettres et en mots : 
# name_score > 1 et jd_ng1_ng2_name > 0.6 (ça suffit pour l'algo pour l'éliminer ) et en plus jd_ng1_ng2_adr > 0.6
name_score = nltk.edit_distance(df_restaurants.iloc[32,1], df_restaurants.iloc[759,1])
name_score

8

In [50]:
 # (jd_ng1_ng2_adr <= 0.6) and jd_ng1_ng2_name <= 0.6) or (name_score<=1)
    
# name_score = nltk.edit_distance(df_restaurants.iloc[32,1], df_restaurants.iloc[759,1])

tokens1 = nltk.word_tokenize(df_restaurants.iloc[32,1])   # name
tokens2 = nltk.word_tokenize( df_restaurants.iloc[759,1]) 
print(tokens1)
print(tokens2)
ng1_tokens = set(nltk.ngrams(tokens1, n=1))
ng2_tokens = set(nltk.ngrams(tokens2, n=1))
print(ng1_tokens)
print(ng2_tokens)

jd_sent_1_2 = nltk.jaccard_distance(ng1_tokens, ng2_tokens)
print(jd_sent_1_2)

['arts', 'delicatessen']
['arts', 'deli']
{('arts',), ('delicatessen',)}
{('deli',), ('arts',)}
0.6666666666666666

In [51]:
 # (jd_ng1_ng2_adr <= 0.6) and (name_score<=2 or jd_ng1_ng2_name <= 0.67)
    
# name_score = nltk.edit_distance(df_restaurants.iloc[32,1], df_restaurants.iloc[759,1])
#print(name_score)
tokens1 = nltk.word_tokenize(df_restaurants.iloc[73,2])   # adresse 
tokens2 = nltk.word_tokenize( df_restaurants.iloc[763,2]) 
print(tokens1)
print(tokens2)
ng1_tokens = set(nltk.ngrams(tokens1, n=1))
ng2_tokens = set(nltk.ngrams(tokens2, n=1))
print(ng1_tokens)
print(ng2_tokens)

jd_sent_1_2 = nltk.jaccard_distance(ng1_tokens, ng2_tokens)
print(jd_sent_1_2)

['3130', 'piedmont', 'road']
['3130', 'piedmont', 'rd', '.', 'ne']
{('road',), ('piedmont',), ('3130',)}
{('ne',), ('.',), ('rd',), ('piedmont',), ('3130',)}
0.6666666666666666

In [52]:
print(len(ground_truth_matches))
print(len(matches_df))
print(len(true_positives) , 'true_positives')
print(len(false_positives) ,'false_positives')
print(len(false_negatives)  , 'false_negatives')

# len(true_positives)  +  len(false_negatives) = len(ground_truth_matches)

# len(matches_df)) - len(false_positif) + len(false_negatives)     = ground_truth_matches

112
127
99 true_positives
28 false_positives
13 false_negatives

In [53]:
precision = len(true_positives)/(len(true_positives)+ len(false_positives))
print(precision)

0.7795275590551181

Note that if you are using pyton 2.7 (instead of Python 3), you would need to convert integers to float prior to performing the division

In [54]:
recall = len(true_positives)/(len(true_positives)+ len(false_negatives))
print(recall)

0.8839285714285714

In [55]:
f_measure = 2*(precision*recall)/(precision+recall)
print(f_measure)

0.8284518828451883

# Windowing (SNM) method

In [56]:
df_restaurants.head()

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
1,1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172
2,2,21 club,21 w. 52nd st.,new york,american,23
3,3,2223,2223 market st.,san francisco,american,453
4,4,9 jones street,9 jones st.,new york,american,173

In [57]:
# 841 842
# qq tests pour choisir sur quel champ on va faire le sort 
# le sorted name parait intéressant
df_restaurants.sort_values(by=['name']).head(20)

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
1,1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172
753,753,21 club,21 w. 52nd st.,new york city,american (new),23
2,2,21 club,21 w. 52nd st.,new york,american,23
3,3,2223,2223 market st.,san francisco,american,453
4,4,9 jones street,9 jones st.,new york,american,173
5,5,abbey,163 ponce de leon ave.,atlanta,international,379
754,754,abruzzi,2355 peachtree rd. ne,atlanta,italian,74
6,6,abruzzi,2355 peachtree rd. peachtree battle shopping...,atlanta,italian,74
7,7,acquarello,1722 sacramento st.,san francisco,italian,454
8,8,adrianos ristorante,2930 beverly glen circle,los angeles,italian,112
9,9,adrienne,700 5th ave. at 55th st.,new york,french,174
10,10,afghan kebab house,764 ninth ave.,new york city,afghan,602
11,11,agrotikon,322 e. 14 st. between 1st and 2nd aves.,new york,mediterranean,175
12,12,aja,937 broadway at 22nd st.,new york,american,176
755,755,alain rondelli,126 clement st.,san francisco,french (new),94
13,13,alain rondelli,126 clement st.,san francisco,french,94
14,14,alamo,304 e. 48th st.,new york,mexican,177
15,15,alecks barbecue heaven,783 martin luther king jr. dr.,atlanta,barbecue,380
16,16,alleys end,311 w. 17th st.,new york,american,178

### Le tri est fait dans ce qui suit selon le champ "name"

In [58]:
window = 50   # 

# tri par name car c ce qui permet d'avoir des resto en double les plus proches possibles 

df_restaurants= df_restaurants.sort_values(by=['name'])  

number_of_matchesw = 0
num_records = len(df_restaurants)
matchesw = []
matchescompletw = []

start = time.process_time()
for i in range(0,min(window,len(df_restaurants))):
    
    tokens1name = nltk.word_tokenize(df_restaurants.iloc[i,1]) 
    ng1_tokensname = set(nltk.ngrams(tokens1name, n=1))
    
    tokens1adr = nltk.word_tokenize(df_restaurants.iloc[i,2]) 
    ng1_tokensadr = set(nltk.ngrams(tokens1adr, n=1))
    
    
    for j in range(i+1,min(window,len(df_restaurants))):
        tokens2name = nltk.word_tokenize( df_restaurants.iloc[j,1]) 
        ng2_tokensname = set(nltk.ngrams(tokens2name, n=1))
        
        
        tokens2adr = nltk.word_tokenize( df_restaurants.iloc[j,2]) 
        ng2_tokensadr = set(nltk.ngrams(tokens2adr, n=1))
#         print(tokens1)
#         print(tokens2)       
        jd_ng1_ng2_name = nltk.jaccard_distance(ng1_tokensname, ng2_tokensname)  # jaccard distance entre les ngram=1 des names
        jd_ng1_ng2_adr = nltk.jaccard_distance(ng1_tokensadr, ng2_tokensadr)  # jaccard distance entre les ngram=1 des adresses
    
        name_score = nltk.edit_distance(df_restaurants.iloc[i,1], df_restaurants.iloc[j,1])
        
        # Rule for matching: Distance between names is smaller or equal to 3 and the cuisine is the same 
        if (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) or name_score<=1 :
            number_of_matchesw = number_of_matchesw +1 
            # matchescomplet.append((df_restaurants.iloc[i,0],df_restaurants.iloc[i,1], df_restaurants.iloc[i,2],df_restaurants.iloc[i,5], df_restaurants.iloc[j,0],df_restaurants.iloc[j,1], df_restaurants.iloc[j,2],df_restaurants.iloc[j,5]))
            matchesw.append((df_restaurants.iloc[i,0],df_restaurants.iloc[j,0]))
            matchescompletw.append((df_restaurants.iloc[i,0],df_restaurants.iloc[i,1], df_restaurants.iloc[i,2],df_restaurants.iloc[i,5], df_restaurants.iloc[j,0],df_restaurants.iloc[j,1], df_restaurants.iloc[j,2],df_restaurants.iloc[j,5]))
                     
            
            
for i in range(window,len(df_restaurants)):
    
    tokens1name = nltk.word_tokenize(df_restaurants.iloc[i,1]) 
    ng1_tokensname = set(nltk.ngrams(tokens1name, n=1))
    
    tokens1adr = nltk.word_tokenize(df_restaurants.iloc[i,2]) 
    ng1_tokensadr = set(nltk.ngrams(tokens1adr, n=1))
    
    
    for j in range(i-window+1,i):
        tokens2name = nltk.word_tokenize( df_restaurants.iloc[j,1]) 
        ng2_tokensname = set(nltk.ngrams(tokens2name, n=1))
        
        
        tokens2adr = nltk.word_tokenize( df_restaurants.iloc[j,2]) 
        ng2_tokensadr = set(nltk.ngrams(tokens2adr, n=1))
     
        jd_ng1_ng2_name = nltk.jaccard_distance(ng1_tokensname, ng2_tokensname)  # jaccard distance entre les ngram=1 des names
        jd_ng1_ng2_adr = nltk.jaccard_distance(ng1_tokensadr, ng2_tokensadr)  # jaccard distance entre les ngram=1 des adresses
    
        name_score = nltk.edit_distance(df_restaurants.iloc[i,1], df_restaurants.iloc[j,1])
        
        # Rule for matching: Distance between names is smaller or equal to 3 and the cuisine is the same 
        if (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) or name_score<=1 :
            number_of_matchesw = number_of_matchesw +1 
            # matchescomplet.append((df_restaurants.iloc[i,0],df_restaurants.iloc[i,1], df_restaurants.iloc[i,2],df_restaurants.iloc[i,5], df_restaurants.iloc[j,0],df_restaurants.iloc[j,1], df_restaurants.iloc[j,2],df_restaurants.iloc[j,5]))
            matchesw.append((df_restaurants.iloc[i,0],df_restaurants.iloc[j,0]))
            matchescompletw.append((df_restaurants.iloc[i,0],df_restaurants.iloc[i,1], df_restaurants.iloc[i,2],df_restaurants.iloc[i,5], df_restaurants.iloc[j,0],df_restaurants.iloc[j,1], df_restaurants.iloc[j,2],df_restaurants.iloc[j,5]))
            
end = time.process_time()

print("Number of matches: {}".format(number_of_matchesw))
print("Processing time: {}".format(end - start))            
for _ in matchescompletw:
     print(_)  
# for _ in matches:
#      print(_)

Number of matches: 112
Processing time: 18.117661999999996
(753, '21 club', ' 21 w. 52nd st.', '23', 2, '21 club', ' 21 w. 52nd st.', '23')
(754, 'abruzzi', ' 2355 peachtree rd. ne', '74', 6, 'abruzzi', ' 2355 peachtree rd.  peachtree battle shopping center', '74')
(755, 'alain rondelli', ' 126 clement st.', '94', 13, 'alain rondelli', ' 126 clement st.', '94')
(27, 'aqua', ' 252 california st.', '95', 757, 'aqua', ' 252 california st.', '95')
(26, 'aquavit', ' 13 w. 54th st.', '24', 756, 'aquavit', ' 13 w. 54th st.', '24')
(30, 'arnie mortons of chicago', ' 435 s. la cienega blv.', '0', 758, 'arnie mortons of chicago', ' 435 s. la cienega blvd.', '0')
(36, 'aureole', ' 34 e. 61st st.', '25', 760, 'aureole', ' 34 e. 61st st.', '25')
(37, 'bacchanalia', ' 3125 piedmont rd.  near peachtree rd.', '75', 761, 'bacchanalia', ' 3125 piedmont rd.', '75')
(56, 'bertolinis', ' 3570 las vegas blvd. s', '427', 55, 'bertolinis', ' 3500 peachtree rd.  phipps plaza', '385')
(76, 'boulevard', ' 1 mission st.', '96', 764, 'boulevard', ' 1 mission st.', '96')
(765, 'brasserie le coze', ' 3393 peachtree rd.', '77', 79, 'brasserie le coze', ' 3393 peachtree rd.  lenox square mall  near neiman marcus', '77')
(88, 'brunos', ' 3838 centinela ave.', '544', 87, 'bruno', ' 240 e. 58th st.', '195')
(766, 'buckhead diner', ' 3073 piedmont rd.', '78', 92, 'buckhead diner', ' 3073 piedmont road', '78')
(99, 'cafe bizou', ' 14016 ventura blvd.', '3', 767, 'cafe bizou', ' 14016 ventura blvd.', '3')
(768, 'cafe claude', ' 7 claude ln.', '97', 103, 'cafe claude', ' 7 claude la.', '97')
(105, 'cafe des artistes', ' 1 w. 67th st.', '27', 769, 'cafe des artistes', ' 1 w. 67th st.', '27')
(109, 'cafe lalo', ' 201 w. 83rd st.', '26', 770, 'cafe lalo', ' 201 w. 83rd st.', '26')
(125, 'caffe roma', ' 385 broome st. at mulberry', '210', 116, 'cafe roma', ' 3570 las vegas blvd. s', '433')
(771, 'campanile', ' 624 s. la brea ave.', '4', 130, 'campanile', ' 624 s. la brea ave.', '4')
(772, 'campton place', ' 340 stockton st.', '98', 132, 'campton place', ' 340 stockton st.', '98')
(141, 'carmines', ' 2450 broadway  between 90th and 91st sts.', '28', 773, 'carmines', ' 2450 broadway', '28')
(142, 'carnegie deli', ' 854 7th ave.  between 54th and 55th sts.', '29', 774, 'carnegie deli', ' 854 seventh ave.', '29')
(154, 'cha cha chas', ' 1805 haight st.', '725', 153, 'cha cha cha', ' 656 n. virgil ave.', '124')
(156, 'chanterelle', ' 2 harrison st.  near hudson st.', '30', 775, 'chanterelle', ' 2 harrison st.', '30')
(776, 'chez michel', ' 804 north point st.', '99', 160, 'chez michel', ' 804 northpoint', '99')
(777, 'chinois on main', ' 2709 main st.', '5', 163, 'chinois on main', ' 2709 main st.', '5')
(778, 'chins', ' 3200 las vegas blvd. s.', '67', 164, 'chins', ' 3200 las vegas blvd. s', '67')
(779, 'ciboulette restaurant', ' 1529 piedmont ave.', '79', 167, 'ciboulette', ' 1529 piedmont ave.', '79')
(780, 'citrus', ' 6703 melrose ave.', '6', 170, 'citrus', ' 6703 melrose ave.', '6')
(186, 'daniel', ' 20 e. 76th st.', '31', 782, 'daniel', ' 20 e. 76th st.', '31')
(783, 'dawat', ' 210 e. 58th st.', '32', 190, 'dawat', ' 210 e. 58th st.', '32')
(784, 'delectables', ' 1 margaret mitchell sq.', '80', 193, 'delectables', ' 1 margaret mitchell sq.', '80')
(785, 'felidia', ' 243 e. 58th st.', '33', 233, 'felidia', ' 243 e. 58th st.', '33')
(235, 'fenix', ' 8358 sunset blvd. west', '7', 234, 'felix', ' 340 w. broadway at grand st.', '237')
(787, 'fleur de lys', ' 777 sutter st.', '100', 245, 'fleur de lys', ' 777 sutter st.', '100')
(250, 'four seasons grill room', ' 99 e. 52nd st.', '34', 788, 'four seasons', ' 99 e. 52nd st.', '34')
(789, 'fringale', ' 570 fourth st.', '101', 257, 'fringale', ' 570 4th st.', '101')
(790, 'georgia grille', ' 2290 peachtree rd.', '81', 264, 'georgia grille', ' 2290 peachtree rd.  peachtree square shopping center', '81')
(791, 'gotham bar & grill', ' 12 e. 12th st.', '35', 274, 'gotham bar & grill', ' 12 e. 12th st.', '35')
(792, 'gramercy tavern', ' 42 e. 20th st.', '36', 275, 'gramercy tavern', ' 42 e. 20th st.  between park ave. s and broadway', '36')
(793, 'granita', ' 23725 w. malibu rd.', '8', 278, 'granita', ' 23725 w. malibu rd.', '8')
(282, 'grill on the alley', ' 9560 dayton way', '9', 794, 'grill  the', ' 9560 dayton way', '9')
(288, 'hard rock cafe', ' 221 w. 57th st.', '261', 287, 'hard rock cafe', ' 8600 beverly blvd.', '137')
(795, 'hawthorne lane', ' 22 hawthorne st.', '102', 294, 'hawthorne lane', ' 22 hawthorne st.', '102')
(796, 'hedgerose heights inn  the', ' 490 e. paces ferry rd. ne', '82', 296, 'hedgerose heights inn', ' 490 e. paces ferry rd.', '82')
(297, 'heera of india', ' 595 piedmont ave.  rio shopping mall', '83', 797, 'heera of india', ' 595 piedmont ave.', '83')
(798, 'indigo coastal grill', ' 1397 n. highland ave.', '84', 321, 'indigo coastal grill', ' 1397 n. highland ave.', '84')
(326, 'island spice', ' 402 w. 44th st.', '37', 799, 'island spice', ' 402 w. 44th st.', '37')
(339, 'jo jo', ' 160 e. 64th st.', '38', 800, 'jo jo', ' 160 e. 64th st.', '38')
(350, 'joss', ' 9255 sunset blvd.', '143', 343, 'joes', ' 1023 abbot kinney blvd.', '560')
(358, 'khan toke thai house', ' 5937 geary blvd.', '103', 802, 'khan toke thai house', ' 5937 geary blvd.', '103')
(367, 'la caravelle', ' 33 w. 55th st.', '39', 803, 'la caravelle', ' 33 w. 55th st.', '39')
(369, 'la cote basque', ' 60 w. 55th st.  between 5th and 6th ave.', '40', 804, 'la cote basque', ' 60 w. 55th st.', '40')
(371, 'la folie', ' 2316 polk st.', '104', 805, 'la folie', ' 2316 polk st.', '104')
(375, 'la grotta', ' 2637 peachtree rd.  peachtree house condominium', '85', 806, 'la grotta', ' 2637 peachtree rd. ne', '85')
(807, 'le bernardin', ' 155 w. 51st st.', '41', 385, 'le bernardin', ' 155 w. 51st st.', '41')
(390, 'le colonial', ' 149 e. 57th st.', '286', 389, 'le colonial', ' 8783 beverly blvd.', '144')
(809, 'le montrachet bistro', ' 3000 paradise rd.', '69', 396, 'le montrachet', ' 3000 w. paradise rd.', '69')
(810, 'les celebrites', ' 155 w. 58th st.', '42', 401, 'les celebrites', ' 160 central park s', '42')
(409, 'locanda veneta', ' 3rd st.', '13', 812, 'locanda veneta', ' 8638 w. third st.', '13')
(421, 'lorangerie', ' 903 n. la cienega blvd.', '11', 815, 'lorangerie', ' 903 n. la cienega blvd.', '11')
(813, 'lulu restaurant-bis-cafe', ' 816 folsom st.', '105', 415, 'lulu', ' 816 folsom st.', '105')
(417, 'lutece', ' 249 e. 50th st.', '44', 814, 'lutece', ' 249 e. 50th st.', '44')
(434, 'manhattan ocean club', ' 57 w. 58th st.', '45', 816, 'manhattan ocean club', ' 57 w. 58th st.', '45')
(817, 'march', ' 405 e. 58th st.', '46', 438, 'march', ' 405 e. 58th st.', '46')
(818, 'mary macs tea room', ' 224 ponce de leon ave.', '86', 446, 'mary macs tea room', ' 224 ponce de leon ave.', '86')
(448, 'masas', ' 648 bush st.', '106', 819, 'masas', ' 648 bush st.', '106')
(449, 'match', ' 160 mercer st.  between houston and prince sts.', '304', 438, 'march', ' 405 e. 58th st.', '46')
(449, 'match', ' 160 mercer st.  between houston and prince sts.', '304', 817, 'march', ' 405 e. 58th st.', '46')
(450, 'matsuhisa', ' 129 n. la cienega blvd.', '14', 820, 'matsuhisa', ' 129 n. la cienega blvd.', '14')
(460, 'mesa grill', ' 102 5th ave.  between 15th and 16th sts.', '47', 821, 'mesa grill', ' 102 fifth ave.', '47')
(461, 'mi cocina', ' 57 jane st.  off hudson st.', '48', 822, 'mi cocina', ' 57 jane st.', '48')
(477, 'montrachet', ' 239 w. broadway  between walker and white sts.', '49', 824, 'montrachet', ' 239 w. broadway', '49')
(483, 'mortons', ' 551 5th ave. at 45th st.', '310', 482, 'mortons', ' 8764 melrose ave.', '148')
(481, 'mortons of chicago (las vegas)', ' 3200 las vegas blvd. s.', '667', 463, 'michaels (las vegas)', ' 3595 las vegas blvd. s.', '664')
(825, 'nikolais roof', ' 255 courtland st.', '87', 497, 'nikolais roof', ' 255 courtland st.  at harris st.', '87')
(504, 'oceana', ' 55 e. 54th st.', '50', 826, 'oceana', ' 55 e. 54th st.', '50')
(519, 'palace court', ' 3570 las vegas blvd. s', '70', 827, 'palace court', ' 3570 las vegas blvd. s.', '70')
(524, 'palm too', ' 840 second ave.', '635', 525, 'palm', ' 837 second ave.', '634')
(529, 'panos and pauls', ' 1232 w. paces ferry rd.', '88', 829, 'panos & pauls', ' 1232 w. paces ferry rd.', '88')
(831, 'patina', ' 5955 melrose ave.', '16', 534, 'patina', ' 5955 melrose ave.', '16')
(832, 'petrossian', ' 182 w. 58th st.', '52', 544, 'petrossian', ' 182 w. 58th st.', '52')
(545, 'philippes the original', ' 1001 n. alameda st.', '17', 833, 'philippe the original', ' 1001 n. alameda st.', '17')
(548, 'picholine', ' 35 w. 64th st.', '53', 834, 'picholine', ' 35 w. 64th st.', '53')
(835, 'pinot bistro', ' 12969 ventura blvd.', '18', 551, 'pinot bistro', ' 12969 ventura blvd.', '18')
(836, 'pisces', ' 95 ave. a', '54', 553, 'pisces', ' 95 ave. a at 6th st.', '54')
(556, 'plumpjack cafe', ' 3201 fillmore st.', '108', 837, 'plumpjack cafe', ' 3127 fillmore st.', '108')
(562, 'postrio', ' 545 post st.', '109', 838, 'postrio', ' 545 post st.', '109')
(567, 'rainbow room', ' 30 rockefeller plaza', '55', 839, 'rainbow room', ' 30 rockefeller plaza', '55')
(571, 'remi', ' 3rd st. promenade', '159', 572, 'remi', ' 145 w. 53rd st.', '334')
(577, 'rex il ristorante', ' 617 s. olive st.', '19', 840, 'rex il ristorante', ' 617 s. olive st.', '19')
(842, 'ritz-carlton dining room (buckhead)', ' 3434 peachtree rd. ne', '90', 841, 'ritz-carlton cafe (buckhead)', ' 3434 peachtree rd. ne', '89')
(844, 'ritz-carlton restaurant', ' 181 peachtree st.', '91', 574, 'restaurant  ritz-carlton  atlanta', ' 181 peachtree st.', '91')
(581, 'river cafe', ' 1 water st. at the east river', '56', 845, 'river cafe', ' 1 water st.', '56')
(589, 'rose pistola', ' 532 columbus ave.', '111', 846, 'rose pistola', ' 532 columbus ave.', '111')
(847, 'san domenico', ' 240 central park s.', '57', 605, 'san domenico', ' 240 central park s', '57')
(616, 'second avenue deli', ' 156 2nd ave. at 10th st.', '58', 848, 'second avenue deli', ' 156 second ave.', '58')
(617, 'second street grille', ' 200 e. fremont st.', '71', 849, 'second street grill', ' 200 e. fremont st.', '71')
(850, 'seryna', ' 11 e. 53rd st.', '59', 619, 'seryna', ' 11 e. 53rd st.', '59')
(625, 'sign of the dove', ' 1110 3rd ave. at 65th st.', '61', 852, 'sign of the dove', ' 1110 third ave.', '61')
(628, 'smith & wollensky', ' 201 e. 49th st.', '62', 853, 'smith & wollensky', ' 797 third ave.', '62')
(855, 'steak house  the', ' 2880 las vegas blvd. s.', '72', 643, 'steak house', ' 2880 las vegas blvd. s', '72')
(644, 'steakhouse  the', ' 128 e. fremont st.', '671', 855, 'steak house  the', ' 2880 las vegas blvd. s.', '72')
(670, 'tavern on the green', ' in central park at 67th st.', '63', 856, 'tavern on the green', ' central park west', '63')
(673, 'teresas', ' 80 montague st.', '647', 672, 'teresas', ' 103 1st ave.  between 6th and 7th sts.', '358')
(857, 'tillerman  the', ' 2245 e. flamingo rd.', '73', 687, 'tillerman', ' 2245 e. flamingo rd.', '73')
(693, 'toulouse', ' b peachtree rd.', '92', 858, 'toulouse', ' 293-b peachtree rd.', '92')
(707, 'uncle nicks', ' 747 9th ave.  between 50th and 51st sts.', '64', 859, 'uncle nicks', ' 747 ninth ave.', '64')
(708, 'union square cafe', ' 21 e. 16th st.', '65', 860, 'union square cafe', ' 21 e. 16th st.', '65')
(861, 'valentino', ' 3115 pico blvd.', '21', 709, 'valentino', ' 3115 pico blvd.', '21')
(862, 'veni vidi vici', ' 41 14th st.', '93', 713, 'veni vidi vici', ' 41 14th st.', '93')
(744, 'yujean kangs gourmet chinese cuisine', ' 67 n. raymond ave.', '22', 864, 'yujean kangs', ' 67 n. raymond ave.', '22')

In [59]:
# Display results
for match in matchesw:
    print("The following records {} and {} match".format(match[0],match[1]))
    print("The restaurants with the following names {} and {} match.".format(df_restaurants.iloc[match[0],1],df_restaurants.iloc[match[1],1]))
    print("The restaurants with the following addresses {} and {} match.".format(df_restaurants.iloc[match[0],2],df_restaurants.iloc[match[1],2]))
    print("\n")

The following records 753 and 2 match
The restaurants with the following names stingray and 21 club match.
The restaurants with the following addresses  428 amsterdam ave.  between 80th and 81st sts. and  21 w. 52nd st. match.


The following records 754 and 6 match
The restaurants with the following names stoyanofs cafe and abbey match.
The restaurants with the following addresses  1240 9th ave. and  163 ponce de leon ave. match.


The following records 755 and 13 match
The restaurants with the following names straits cafe and agrotikon match.
The restaurants with the following addresses  3300 geary blvd. and  322 e. 14 st.  between 1st and 2nd aves. match.


The following records 27 and 757 match
The restaurants with the following names antonios and sundown cafe match.
The restaurants with the following addresses  3700 w. flamingo and  2165 cheshire bridge rd. match.


The following records 26 and 756 match
The restaurants with the following names anthonys and stringers fish camp and oyster bar match.
The restaurants with the following addresses  3109 piedmont rd.  just south of peachtree rd. and  3384 shallowford rd.  chamblee match.


The following records 30 and 758 match
The restaurants with the following names aqua and suppenkuche match.
The restaurants with the following addresses  252 california st. and  601 hayes st. match.


The following records 36 and 760 match
The restaurants with the following names arnie mortons of chicago and sushisay match.
The restaurants with the following addresses  435 s. la cienega blvd. and  38 e. 51st st. match.


The following records 37 and 761 match
The restaurants with the following names arts deli and swan oyster depot match.
The restaurants with the following addresses  12224 ventura blvd. and  1517 polk st. match.


The following records 56 and 55 match
The restaurants with the following names battistas hole in the wall and barney greengrass match.
The restaurants with the following addresses  4041 audrie st. at flamingo rd. and  9570 wilshire blvd. match.


The following records 76 and 764 match
The restaurants with the following names bistro garden and swingers match.
The restaurants with the following addresses  176 n. canon dr. and  8020 beverly blvd. match.


The following records 765 and 79 match
The restaurants with the following names sylvias and bizou match.
The restaurants with the following addresses  328 lenox ave. and  598 fourth st. match.


The following records 88 and 87 match
The restaurants with the following names boulevard and boulevard match.
The restaurants with the following addresses  1 mission st. and  1 mission st. match.


The following records 766 and 92 match
The restaurants with the following names szechuan hunan cottage and brasserie le coze match.
The restaurants with the following addresses  1588 york ave. and  3393 peachtree rd. match.


The following records 99 and 767 match
The restaurants with the following names brothers bar-b-q and szechuan kitchen match.
The restaurants with the following addresses  225 varick st. at clarkston st. and  1460 first ave. match.


The following records 768 and 103 match
The restaurants with the following names t salon and buca giovanni match.
The restaurants with the following addresses  143 mercer st. at prince st. and  800 greenwich st. match.


The following records 105 and 769 match
The restaurants with the following names buckhead diner and tadich grill match.
The restaurants with the following addresses  3073 piedmont road and  240 california st. match.


The following records 109 and 770 match
The restaurants with the following names c3 and taiko match.
The restaurants with the following addresses  103 waverly pl.  near washington sq. and  11677 san vicente blvd. match.


The following records 125 and 116 match
The restaurants with the following names cafe des artistes and cafe bizou match.
The restaurants with the following addresses  1 w. 67th st. and  14016 ventura blvd. match.


The following records 771 and 130 match
The restaurants with the following names tang pavillion and cafe lalo match.
The restaurants with the following addresses  65 w. 55th st. and  201 w. 83rd st. match.


The following records 772 and 132 match
The restaurants with the following names tapika and cafe marimba match.
The restaurants with the following addresses  950 8th ave. at 56th st. and  2317 chestnut st. match.


The following records 141 and 773 match
The restaurants with the following names caffe dellartista and taste of new orleans match.
The restaurants with the following addresses  46 greenwich ave. and  889 w. peachtree st. match.


The following records 142 and 774 match
The restaurants with the following names caffe greco and tavern on the green match.
The restaurants with the following addresses  423 columbus ave. and  central park west match.


The following records 154 and 153 match
The restaurants with the following names campton place and campton place match.
The restaurants with the following addresses  340 stockton st. and  340 stockton st. match.


The following records 156 and 775 match
The restaurants with the following names canters and tavern on the green match.
The restaurants with the following addresses  419 n. fairfax ave. and  in central park at 67th st. match.


The following records 776 and 160 match
The restaurants with the following names tavola calda and captains table match.
The restaurants with the following addresses  7371 melrose ave. and  860 2nd ave. at 46th st. match.


The following records 777 and 163 match
The restaurants with the following names teresas and carmines match.
The restaurants with the following addresses  103 1st ave.  between 6th and 7th sts. and  2450 broadway match.


The following records 778 and 164 match
The restaurants with the following names teresas and carmines match.
The restaurants with the following addresses  80 montague st. and  2450 broadway  between 90th and 91st sts. match.


The following records 779 and 167 match
The restaurants with the following names terrace and carnival world match.
The restaurants with the following addresses  400 w. 119th st.  between amsterdam and morningside aves. and  3700 w. flamingo rd. match.


The following records 780 and 170 match
The restaurants with the following names thai house cafe and cassells match.
The restaurants with the following addresses  151 hudson st. and  3266 w. sixth st. match.


The following records 186 and 782 match
The restaurants with the following names china grill and the bacchanal match.
The restaurants with the following addresses  60 w. 53rd st. and  3570 las vegas blvd. s match.


The following records 783 and 190 match
The restaurants with the following names the coffee pot and chins match.
The restaurants with the following addresses  350 9th ave. at 49th st. and  3200 las vegas blvd. s. match.


The following records 784 and 193 match
The restaurants with the following names the heights and ciboulette match.
The restaurants with the following addresses  3235 sacramento st. and  1529 piedmont ave. match.


The following records 785 and 233 match
The restaurants with the following names the mandarin and docks match.
The restaurants with the following addresses  430 n. camden dr. and  633 3rd ave. at 40th st. match.


The following records 235 and 234 match
The restaurants with the following names don antonios and doidges match.
The restaurants with the following addresses  1136 westwood blvd. and  2217 union st. match.


The following records 787 and 245 match
The restaurants with the following names the savannah club and eclipse match.
The restaurants with the following addresses  2420 broadway at 89th st. and  8800 melrose ave. match.


The following records 250 and 788 match
The restaurants with the following names el teddys and thelmas kitchen match.
The restaurants with the following addresses  219 w. broadway  between franklin and white sts. and  764 marietta st. nw match.


The following records 789 and 257 match
The restaurants with the following names thep phanom and erics chinese restaurant match.
The restaurants with the following addresses  400 waller st. and  1500 church st. match.


The following records 790 and 264 match
The restaurants with the following names thepin and feast match.
The restaurants with the following addresses  298 gough st. and  2411 w. sahara ave. match.


The following records 791 and 274 match
The restaurants with the following names ti couz and fiore rotisserie & grille match.
The restaurants with the following addresses  3108 16th st. and  3700 w. flamingo rd. match.


The following records 792 and 275 match
The restaurants with the following names tillerman and fiorellos roman cafe match.
The restaurants with the following addresses  2245 e. flamingo rd. and  1900 broadway  between 63rd and 64th sts. match.


The following records 793 and 278 match
The restaurants with the following names tillerman  the and fishin eddie match.
The restaurants with the following addresses  2245 e. flamingo rd. and  73 w. 71st st. match.


The following records 282 and 794 match
The restaurants with the following names flowers and tommy tangs match.
The restaurants with the following addresses  21 west 17th st.  between 5th and 6th aves. and  7313 melrose ave. match.


The following records 288 and 287 match
The restaurants with the following names fraunces tavern and four seasons grill room match.
The restaurants with the following addresses  54 pearl st. at broad st. and  99 e. 52nd st. match.


The following records 795 and 294 match
The restaurants with the following names tommys and fringale match.
The restaurants with the following addresses  2575 beverly blvd. and  570 4th st. match.


The following records 796 and 296 match
The restaurants with the following names tomtom and fujiyama mama match.
The restaurants with the following addresses  3393 peachtree rd. and  467 columbus ave.  between 82nd and 83rd sts. match.


The following records 297 and 797 match
The restaurants with the following names gabrielas and ton kiang match.
The restaurants with the following addresses  685 amsterdam ave. at 93rd st. and  3148 geary blvd. match.


The following records 798 and 321 match
The restaurants with the following names tortillas and greens match.
The restaurants with the following addresses  774 ponce de leon ave. ne and  bldg. a fort mason match.


The following records 326 and 799 match
The restaurants with the following names halcyon and toulouse match.
The restaurants with the following addresses  151 w. 54th st.  in the rihga royal hotel and  293-b peachtree rd. match.


The following records 339 and 800 match
The restaurants with the following names hedgerose heights inn and toulouse match.
The restaurants with the following addresses  490 e. paces ferry rd. and  b peachtree rd. match.


The following records 350 and 343 match
The restaurants with the following names horseradish grill and helmand match.
The restaurants with the following addresses  4320 powers ferry rd. and  430 broadway match.


The following records 358 and 802 match
The restaurants with the following names il cortile and trader vics match.
The restaurants with the following addresses  125 mulberry st.  between canal and hester sts. and  9876 wilshire blvd. match.


The following records 367 and 803 match
The restaurants with the following names indigo coastal grill and trattoria dellarte match.
The restaurants with the following addresses  1397 n. highland ave. and  900 7th ave.  between 56th and 57th sts. match.


The following records 369 and 804 match
The restaurants with the following names indochine and tre visi match.
The restaurants with the following addresses  430 lafayette st.  between 4th st. and astor pl. and  3799 las vegas blvd. s. match.


The following records 371 and 805 match
The restaurants with the following names ipanema and triangolo match.
The restaurants with the following addresses  13 w. 46th st. and  345 e. 83rd st. match.


The following records 375 and 806 match
The restaurants with the following names jack sprats grill and tribeca grill match.
The restaurants with the following addresses  10668 w. pico blvd. and  375 greenwich st.  near franklin st. match.


The following records 807 and 385 match
The restaurants with the following names trio cafe and jiraffe match.
The restaurants with the following addresses  1870 fillmore st. and  502 santa monica blvd match.


The following records 390 and 389 match
The restaurants with the following names joes and joe allen match.
The restaurants with the following addresses  1023 abbot kinney blvd. and  326 w. 46th st. match.


The following records 809 and 396 match
The restaurants with the following names tse yang and johnny rockets (la) match.
The restaurants with the following addresses  34 e. 51st st. and  7507 melrose ave. match.


The following records 810 and 401 match
The restaurants with the following names tu lan and kalos coffee house match.
The restaurants with the following addresses  8 sixth st. and  1248 clairmont rd. match.


The following records 409 and 812 match
The restaurants with the following names kiev and two two two match.
The restaurants with the following addresses  117 second ave. and  222 w. 79th st. match.


The following records 421 and 815 match
The restaurants with the following names la cote basque and uncle nicks match.
The restaurants with the following addresses  60 w. 55th st.  between 5th and 6th ave. and  747 9th ave.  between 50th and 51st sts. match.


The following records 813 and 415 match
The restaurants with the following names uncle bills pancake house and kyo-ya. sheraton palace hotel match.
The restaurants with the following addresses  1305 highland ave. and  2 new montgomery st.  at market st. match.


The following records 417 and 814 match
The restaurants with the following names la caravelle and uncle nicks match.
The restaurants with the following addresses  33 w. 55th st. and  747 ninth ave. match.


The following records 434 and 816 match
The restaurants with the following names la taqueria and union square cafe match.
The restaurants with the following addresses  2889 mission st. and  21 e. 16th st. match.


The following records 817 and 438 match
The restaurants with the following names union square cafe and lattanzi ristorante match.
The restaurants with the following addresses  21 e. 16th st. and  361 w. 46th st. match.


The following records 818 and 446 match
The restaurants with the following names valentino and le chardonnay match.
The restaurants with the following addresses  3115 pico blvd. and  8284 melrose ave. match.


The following records 448 and 819 match
The restaurants with the following names le colonial and valentino match.
The restaurants with the following addresses  8783 beverly blvd. and  3115 pico blvd. match.


The following records 449 and 438 match
The restaurants with the following names le colonial and lattanzi ristorante match.
The restaurants with the following addresses  149 e. 57th st. and  361 w. 46th st. match.


The following records 449 and 817 match
The restaurants with the following names le colonial and union square cafe match.
The restaurants with the following addresses  149 e. 57th st. and  21 e. 16th st. match.


The following records 450 and 820 match
The restaurants with the following names le dome and van goghs restaurant & bar match.
The restaurants with the following addresses  8720 sunset blvd. and  70 w. crossville rd. match.


The following records 460 and 821 match
The restaurants with the following names lemongrass grill and veggieland match.
The restaurants with the following addresses  61a seventh ave. and  220 sandy springs circle match.


The following records 461 and 822 match
The restaurants with the following names les celebrites and venetian match.
The restaurants with the following addresses  160 central park s and  3713 w. sahara ave. match.


The following records 477 and 824 match
The restaurants with the following names losteria del forno and veni vidi vici match.
The restaurants with the following addresses  519 columbus ave. and  41 14th st. match.


The following records 483 and 482 match
The restaurants with the following names lulu restaurant-bis-cafe and lulu match.
The restaurants with the following addresses  816 folsom st. and  816 folsom st. match.


The following records 481 and 463 match
The restaurants with the following names ludo and les halles match.
The restaurants with the following addresses  432 lafayette st.  near astor pl. and  411 park ave. s  between 28th and 29th sts. match.


The following records 825 and 497 match
The restaurants with the following names venieros pasticceria and manhattan ocean club match.
The restaurants with the following addresses  342 e. 11th st.  near 1st ave. and  57 w. 58th st. match.


The following records 504 and 826 match
The restaurants with the following names margaritas mexican cantina and verbena match.
The restaurants with the following addresses  3120 las vegas blvd. s and  54 irving pl. at 17th st. match.


The following records 519 and 827 match
The restaurants with the following names matthews and vertigo match.
The restaurants with the following addresses  1030 3rd ave. at 61st st. and  600 montgomery st. match.


The following records 524 and 525 match
The restaurants with the following names mccormick & kuletos and mckinnons louisiane match.
The restaurants with the following addresses  ghirardelli sq. and  3209 maple dr. match.


The following records 529 and 829 match
The restaurants with the following names mesa grill and vicolo pizzeria match.
The restaurants with the following addresses  102 5th ave.  between 15th and 16th sts. and  201 ivy st. match.


The following records 831 and 534 match
The restaurants with the following names vida and michaels (los angeles) match.
The restaurants with the following addresses  1930 north hillhurst ave. and  1147 third st. match.


The following records 832 and 544 match
The restaurants with the following names vince & eddies and monkey bar match.
The restaurants with the following addresses  70 w. 68th st. and  60 e. 54th st. match.


The following records 545 and 833 match
The restaurants with the following names monsoon (ny) and virgils match.
The restaurants with the following addresses  435 amsterdam ave. and  152 w. 44th st. match.


The following records 548 and 834 match
The restaurants with the following names montrachet and virgils real bbq match.
The restaurants with the following addresses  239 w. broadway and  152 w. 44th st. match.


The following records 835 and 551 match
The restaurants with the following names viva mercados and mooses match.
The restaurants with the following addresses  6182 w. flamingo rd. and  1652 stockton st. match.


The following records 836 and 553 match
The restaurants with the following names vivande porta via and mortons match.
The restaurants with the following addresses  2125 fillmore st. and  551 5th ave. at 45th st. match.


The following records 556 and 837 match
The restaurants with the following names mos burgers and vivande ristorante match.
The restaurants with the following addresses  1322 grant st. and  670 golden gate ave. match.


The following records 562 and 838 match
The restaurants with the following names nate n als and vong match.
The restaurants with the following addresses  414 n. beverly dr. and  200 e. 54th st. match.


The following records 567 and 839 match
The restaurants with the following names nickiemotos: a sushi bar and wa-ha-ka oaxaca mexican grill match.
The restaurants with the following addresses  247 buckhead ave.  east village sq. and  2141 polk st. match.


The following records 571 and 572 match
The restaurants with the following names nikolais roof and nobu match.
The restaurants with the following addresses  255 courtland st. and  105 hudson st. match.



In [60]:
matchesw_df = pd.DataFrame(matchesw)
matchesw_df.columns= ['record_ID_x','record_ID_y']

matchesw_df['MIN'] = matchesw_df[['record_ID_x','record_ID_y']].min(axis=1)
matchesw_df['MAX'] = matchesw_df[['record_ID_x','record_ID_y']].max(axis=1)
matchesw_df=matchesw_df[['MIN','MAX']]
matchesw_df.columns=['record_ID_x','record_ID_y']
matchesw_df


diffw_df = pd.merge(ground_truth_matches, matchesw_df, how='outer', indicator='Exist')
true_positivesw = diffw_df[diffw_df.Exist=='both']
false_positivesw = diffw_df[diffw_df.Exist=='right_only']
false_negativesw = diffw_df[diffw_df.Exist=='left_only']
precisionw = len(true_positivesw)/(len(true_positivesw)+ len(false_positivesw))
print(precisionw)
recallw = len(true_positivesw)/(len(true_positivesw)+ len(false_negativesw))
print(recallw)
f_measurew = 2*(precisionw*recallw)/(precisionw+recallw)
print(f_measurew)

0.8482142857142857
0.8482142857142857
0.8482142857142857

In [61]:
print(len(ground_truth_matches))
print(len(matchesw_df))
print(len(true_positivesw))
print(len(false_positivesw))
print(len(false_negativesw))  
# len(true_positives)  +  len(false_negatives) = len(ground_truth_matches)
# len(matches_df)) - len(false_positif) + len(false_negatives)     = ground_truth_matches

112
112
95
17
17

It is worth noting that in the above code, we do not implement the SNM algorithm in its entirety. In particular, we do not implement the last phase of inferring matches using transitivity

# Blocking method

In [62]:
df_restaurants = pd.read_csv("./restaurants.csv")

In [63]:
len(df_restaurants)

865

In [64]:
df_restaurants.head()

,name,address,city,cuisine,unique_id
0,103 west,103 w. paces ferry rd.,atlanta,continental,675
1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172
2,21 club,21 w. 52nd st.,new york,american,23
3,2223,2223 market st.,san francisco,american,453
4,9 jones street,9 jones st.,new york,american,173

In [65]:
# We start by adding a new column to identify the records (lines) in our dataframe
df_restaurants.insert(0,'record_ID', range(0, len(df_restaurants)))

In [66]:
# The blocks correspond to resturants that are located in the same citydf_restaurants.loc[df_restaurants['city']==' atlanta']
df_restaurants.loc[df_restaurants['city']==' atlanta']

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
5,5,abbey,163 ponce de leon ave.,atlanta,international,379
6,6,abruzzi,2355 peachtree rd. peachtree battle shopping...,atlanta,italian,74
15,15,alecks barbecue heaven,783 martin luther king jr. dr.,atlanta,barbecue,380
17,17,alons at the terrace,659 peachtree st.,atlanta,sandwiches,676
...,...,...,...,...,...,...
841,841,ritz-carlton cafe (buckhead),3434 peachtree rd. ne,atlanta,american (new),89
842,842,ritz-carlton dining room (buckhead),3434 peachtree rd. ne,atlanta,american (new),90
844,844,ritz-carlton restaurant,181 peachtree st.,atlanta,french (classic),91
858,858,toulouse,293-b peachtree rd.,atlanta,french (new),92
862,862,veni vidi vici,41 14th st.,atlanta,italian,93

In [67]:
df_restaurants.loc[df_restaurants['city'].str.strip()=='atlanta']

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
5,5,abbey,163 ponce de leon ave.,atlanta,international,379
6,6,abruzzi,2355 peachtree rd. peachtree battle shopping...,atlanta,italian,74
15,15,alecks barbecue heaven,783 martin luther king jr. dr.,atlanta,barbecue,380
17,17,alons at the terrace,659 peachtree st.,atlanta,sandwiches,676
...,...,...,...,...,...,...
841,841,ritz-carlton cafe (buckhead),3434 peachtree rd. ne,atlanta,american (new),89
842,842,ritz-carlton dining room (buckhead),3434 peachtree rd. ne,atlanta,american (new),90
844,844,ritz-carlton restaurant,181 peachtree st.,atlanta,french (classic),91
858,858,toulouse,293-b peachtree rd.,atlanta,french (new),92
862,862,veni vidi vici,41 14th st.,atlanta,italian,93

In [68]:
# on va créer un dict "df_restov" des restaurants de chaque ville
# pour une clé= ville, la valeur du dict serait égale à un dataframe représentant les restos de cette ville
df_restov= {}
for ville in df_restaurants['city'].unique():
    
    df_restov[ville]   = df_restaurants.loc[df_restaurants['city']==ville]
    num_records = len(df_restov[ville])
    print(ville)   # on affiche la ville
    print(num_records) # on affiche le nombre de restos par ville

 atlanta
120
 new york
250
 san francisco
148
 los angeles
74
 new york city
88
 las vegas
63
 west la
4
 studio city
5
 westlake village
2
 beverly hills
8
 malibu
4
 santa monica
14
 pasadena
6
 northridge
1
 mar vista
1
 sherman oaks
3
 venice
3
 marietta
2
 la
15
 redondo beach
1
 w. hollywood
6
 westwood
2
 queens
5
 hollywood
2
 pacific palisades
1
 roswell
2
 bel air
2
 smyrna
1
 duluth
2
 culver city
1
 long beach
1
 decatur
2
 century city
1
 st. boyle hts.
1
 brooklyn
6
 rancho park
1
 st. hermosa beach
1
 marina del rey
1
 encino
2
 monterey park
1
 toluca lake
1
 chinatown
2
 burbank
1
 seal beach
1
 brentwood
1
 manhattan beach
1
 los feliz
2
 college park
1
 glendale
1
city
1

In [69]:
# on vérifie  pour atlanta que ça marche bien, on a bien le dataframe qu'on voudrait.
print(type(df_restov[" atlanta"]))
print(df_restov[" atlanta"])

<class 'pandas.core.frame.DataFrame'>
     record_ID                                 name  \
0            0                             103 west
5            5                                abbey
6            6                              abruzzi
15          15               alecks barbecue heaven
17          17                 alons at the terrace
..         ...                                  ...
841        841         ritz-carlton cafe (buckhead)
842        842  ritz-carlton dining room (buckhead)
844        844              ritz-carlton restaurant
858        858                             toulouse
862        862                       veni vidi vici

                                               address      city  \
0                               103 w. paces ferry rd.   atlanta
5                               163 ponce de leon ave.   atlanta
6     2355 peachtree rd.  peachtree battle shopping...   atlanta
15                      783 martin luther king jr. dr.   atlanta
17                                   659 peachtree st.   atlanta
..                                                 ...       ...
841                              3434 peachtree rd. ne   atlanta
842                              3434 peachtree rd. ne   atlanta
844                                  181 peachtree st.   atlanta
858                                293-b peachtree rd.   atlanta
862                                        41 14th st.   atlanta

               cuisine unique_id
0          continental       675
5        international       379
6              italian        74
15            barbecue       380
17          sandwiches       676
..                 ...       ...
841     american (new)        89
842     american (new)        90
844   french (classic)        91
858       french (new)        92
862            italian        93

[120 rows x 6 columns]

In [70]:
df_restov[" atlanta"].head()

,record_ID,name,address,city,cuisine,unique_id
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675
5,5,abbey,163 ponce de leon ave.,atlanta,international,379
6,6,abruzzi,2355 peachtree rd. peachtree battle shopping...,atlanta,italian,74
15,15,alecks barbecue heaven,783 martin luther king jr. dr.,atlanta,barbecue,380
17,17,alons at the terrace,659 peachtree st.,atlanta,sandwiches,676

In [71]:
# on testel'algo précédent sur juste un dataframe celui des restos de " atlanta"  (avec un espace devant)
num_records = len(df_restov[" atlanta"])
amatches = []
amatchescomplet = []

anumber_of_matches = 0
tokens1=[]
tokens2=[]
start = time.process_time()
for i in range(0,num_records):
    
    # Après tokenization , calcul du ngrams (n=1) pour le name qui servira pour la Jaccard distance, pour la ligne i
    tokens1name = nltk.word_tokenize(df_restov[" atlanta"].iloc[i,1]) 
    ng1_tokensname = set(nltk.ngrams(tokens1name, n=1))
    
    # Après tokenization , calcul du ngrams (n=1) pour l'adresse qui servira pour la Jaccard distance,, pour la ligne i
    tokens1adr = nltk.word_tokenize(df_restov[" atlanta"].iloc[i,2]) 
    ng1_tokensadr = set(nltk.ngrams(tokens1adr, n=1))
    
    
    for j in range(i+1,num_records):
        
        # Après tokenization , calcul du ngrams (n=1) pour le name qui servira pour la Jaccard distance, , pour la ligne j
        tokens2name = nltk.word_tokenize( df_restov[" atlanta"].iloc[j,1]) 
        ng2_tokensname = set(nltk.ngrams(tokens2name, n=1))
        
        # Après tokenization , calcul du ngrams (n=1) pour le name qui servira pour la Jaccard distance, , pour la ligne j
        tokens2adr = nltk.word_tokenize( df_restov[" atlanta"].iloc[j,2]) 
        ng2_tokensadr = set(nltk.ngrams(tokens2adr, n=1))
     
        # calcul de la Jaccard distance pour le name entre la ligne i et la ligne j ("item based" avec ngrams (n=1)) 
        jd_ng1_ng2_name = nltk.jaccard_distance(ng1_tokensname, ng2_tokensname)
        
        # calcul de la Jaccard distance pour l'adresse entre la ligne i et la ligne j ("item based" avec ngrams (n=1)) 
        jd_ng1_ng2_adr = nltk.jaccard_distance(ng1_tokensadr, ng2_tokensadr)  
    
        name_score = nltk.edit_distance(df_restov[" atlanta"].iloc[i,1], df_restov[" atlanta"].iloc[j,1])
        
        # Rule for matching: 
        # disjonction entre une similarité entre les names (name_score<=1) 
        # et une similarité conjugée entre les adresses et les noms (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6)
        if (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) or name_score<=1 :
            anumber_of_matches = anumber_of_matches +1 
            matchescomplet.append((df_restov[" atlanta"].iloc[i,0],df_restov[" atlanta"].iloc[i,1], \
            df_restov[" atlanta"].iloc[i,2],df_restov[" atlanta"].iloc[i,3], df_restov[" atlanta"].iloc[i,5], \
            df_restov[" atlanta"].iloc[j,0],df_restov[" atlanta"].iloc[j,1], df_restov[" atlanta"].iloc[j,2], \
            df_restov[" atlanta"].iloc[j,3],df_restov[" atlanta"].iloc[j,5]))
            amatches.append((df_restov[" atlanta"].iloc[i,0],df_restov[" atlanta"].iloc[j,0]))

end = time.process_time()

print("Number of matches: {}".format(anumber_of_matches))
print("Processing time: {}".format(end - start))
for _ in amatchescomplet:
     print(_)

Number of matches: 21
Processing time: 3.543459000000013

In [72]:
# nous allons refaire le dict mais en éliminant les espaces saisis avant et après chaque ville
# par précaution pour éviter des villes en double
# et nous allons imprimer le nombre de restos par ville.

df_restov={}
cumul= 0
# il faut enlever les espaces au début et à la fin de chaque ville dans le dataframe, 
# sinon on va rater des restos en double car ils ne seront pas dans le même block.

for ville in df_restaurants['city'].str.strip().unique():   
     print(ville)
     df_restov[ville]   = df_restaurants.loc[df_restaurants['city'].str.strip()==ville]
     print(len(df_restov[ville]))
     cumul += len(df_restov[ville])

print(cumul)
# on vérifie qu'on retrouve bien un total de 865 restaurants.

atlanta
120
new york
250
san francisco
148
los angeles
74
new york city
88
las vegas
63
west la
4
studio city
5
westlake village
2
beverly hills
8
malibu
4
santa monica
14
pasadena
6
northridge
1
mar vista
1
sherman oaks
3
venice
3
marietta
2
la
15
redondo beach
1
w. hollywood
6
westwood
2
queens
5
hollywood
2
pacific palisades
1
roswell
2
bel air
2
smyrna
1
duluth
2
culver city
1
long beach
1
decatur
2
century city
1
st. boyle hts.
1
brooklyn
6
rancho park
1
st. hermosa beach
1
marina del rey
1
encino
2
monterey park
1
toluca lake
1
chinatown
2
burbank
1
seal beach
1
brentwood
1
manhattan beach
1
los feliz
2
college park
1
glendale
1
city
1
865

In [73]:
# Généralisation de la BLOCKING METHOD à toutes les villes 
bmatches = []
bmatchescomplet = []
bnumber_of_matches = 0
start = time.process_time()
    
for ville in df_restaurants['city'].str.strip().unique():
        # affichage de la ville et du nombre de restos par ville
        # pour les matcher entre eux
        print(ville)  
        num_records = len(df_restov[ville])
        print(num_records)
        
        tokens1=[]
        tokens2=[]
       
        for i in range(0,num_records):

            tokens1name = nltk.word_tokenize(df_restov[ville].iloc[i,1]) 
            ng1_tokensname = set(nltk.ngrams(tokens1name, n=1))

            tokens1adr = nltk.word_tokenize(df_restov[ville].iloc[i,2]) 
            ng1_tokensadr = set(nltk.ngrams(tokens1adr, n=1))


            for j in range(i+1,num_records):

                tokens2name = nltk.word_tokenize( df_restov[ville].iloc[j,1]) 
                ng2_tokensname = set(nltk.ngrams(tokens2name, n=1))


                tokens2adr = nltk.word_tokenize( df_restov[ville].iloc[j,2]) 
                ng2_tokensadr = set(nltk.ngrams(tokens2adr, n=1))

                jd_ng1_ng2_name = nltk.jaccard_distance(ng1_tokensname, ng2_tokensname)  # jaccard distance entre les ngram=1 des names
                jd_ng1_ng2_adr = nltk.jaccard_distance(ng1_tokensadr, ng2_tokensadr)  # jaccard distance entre les ngram=1 des adresses

                name_score = nltk.edit_distance(df_restov[ville].iloc[i,1], df_restov[ville].iloc[j,1])

                # Rule for matching: Item based Jaccard Distance with ngram=1 between adresses and between names or edit distance between names 
                if (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) or name_score<=1 :
                    bnumber_of_matches = bnumber_of_matches +1 
                    bmatchescomplet.append((df_restov[ville].iloc[i,0],df_restov[ville].iloc[i,1], \
                    df_restov[ville].iloc[i,2],df_restov[ville].iloc[i,3], df_restov[ville].iloc[i,5], \
                    df_restov[ville].iloc[j,0],df_restov[ville].iloc[j,1], df_restov[ville].iloc[j,2], \
                    df_restov[ville].iloc[j,3],df_restov[ville].iloc[j,5]))
                    bmatches.append((df_restov[ville].iloc[i,0],df_restov[ville].iloc[j,0]))

end = time.process_time()

print("Number of matches: {}".format(bnumber_of_matches))
print("Processing time: {}".format(end - start))
# for _ in matchescomplet:
#        print(_)

atlanta
120
new york
250
san francisco
148
los angeles
74
new york city
88
las vegas
63
west la
4
studio city
5
westlake village
2
beverly hills
8
malibu
4
santa monica
14
pasadena
6
northridge
1
mar vista
1
sherman oaks
3
venice
3
marietta
2
la
15
redondo beach
1
w. hollywood
6
westwood
2
queens
5
hollywood
2
pacific palisades
1
roswell
2
bel air
2
smyrna
1
duluth
2
culver city
1
long beach
1
decatur
2
century city
1
st. boyle hts.
1
brooklyn
6
rancho park
1
st. hermosa beach
1
marina del rey
1
encino
2
monterey park
1
toluca lake
1
chinatown
2
burbank
1
seal beach
1
brentwood
1
manhattan beach
1
los feliz
2
college park
1
glendale
1
city
1
Number of matches: 67
Processing time: 22.973241

#### Rappel des résultats de l'algo original sans blocking:
####  Number of matches: 127
#### Processing time: 167.984375

#### les infos de l'algo avec  blocking ci-dessus
#### Number of matches: 67
#### Processing time: 25.6875

In [74]:
import pandas as pd
ground_truth_matches = pd.read_csv("./restaurants.csv")
len(ground_truth_matches)

865

In [75]:
ground_truth_matches.insert(0, 'record_ID', range(0, len(ground_truth_matches)))

In [76]:
ground_truth_matches = pd.merge(ground_truth_matches,
                                ground_truth_matches,
                                on = 'unique_id')

In [77]:
ground_truth_matches.head(5)

,record_ID_x,name_x,address_x,city_x,cuisine_x,unique_id,record_ID_y,name_y,address_y,city_y,cuisine_y
0,0,103 west,103 w. paces ferry rd.,atlanta,continental,675,0,103 west,103 w. paces ferry rd.,atlanta,continental
1,1,20 mott,20 mott st. between bowery and pell st.,new york,asian,172,1,20 mott,20 mott st. between bowery and pell st.,new york,asian
2,2,21 club,21 w. 52nd st.,new york,american,23,2,21 club,21 w. 52nd st.,new york,american
3,2,21 club,21 w. 52nd st.,new york,american,23,753,21 club,21 w. 52nd st.,new york city,american (new)
4,753,21 club,21 w. 52nd st.,new york city,american (new),23,2,21 club,21 w. 52nd st.,new york,american

In [78]:
ground_truth_matches = ground_truth_matches.query('record_ID_x < record_ID_y')
len(ground_truth_matches)

112

In [79]:
ground_truth_matches = ground_truth_matches[['record_ID_x','record_ID_y']]

In [80]:
bmatches_df = pd.DataFrame(bmatches)
bmatches_df.columns= ['record_ID_x','record_ID_y']
bmatches_df.head()

   record_ID_x  record_ID_y
0            6          754
1           37          761
2           79          765
3           92          766
4           96          196

In [81]:
# on s'assure que les couples record_ID_x et record_ID_y sont dans le bons sens (record_ID_x < record_ID_y)
bmatches_df[bmatches_df['record_ID_x'] >= bmatches_df['record_ID_y'] ]
# 0 lignes trouvées , donc c OK.

Empty DataFrame
Columns: [record_ID_x, record_ID_y]
Index: []

In [82]:
diff_df = pd.merge(ground_truth_matches, bmatches_df, how='outer', indicator='Exist')
diff_df.head()

   record_ID_x  record_ID_y      Exist
0            2          753  left_only
1            6          754       both
2           13          755       both
3           26          756  left_only
4           27          757       both

In [83]:
btrue_positives = diff_df[diff_df.Exist=='both']
bfalse_positives = diff_df[diff_df.Exist=='right_only']
bfalse_negatives = diff_df[diff_df.Exist=='left_only']

In [84]:
true_positives.head()

   record_ID_x  record_ID_y Exist
0            2          753  both
1            6          754  both
2           13          755  both
3           26          756  both
4           27          757  both

In [85]:
# un vrai positif: c un vrai couple de restos en double qui a été détecté par notre algo sous forme de blocking method.
# en effet il vérifie le critère de name (edit_distance=0) et en plus les 2 restos se trouve dans la même ville d'atlanta.
df_restaurants[df_restaurants.record_ID.isin(['6','754'])]

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [86]:
# les couples détectés par notre algo comme des doubles mais à tort, ce ne sont pas des doubles.
false_positives.head()

     record_ID_x  record_ID_y       Exist
112           55           56  right_only
113           87           88  right_only
114           95          180  right_only
115           96          196  right_only
116          116          125  right_only

In [87]:
df_restaurants[df_restaurants.record_ID.isin(['96','196'])]
# ce couple n'est pas dans le ground_truth car unique_id différent
# mais il est dans le bmatches_df , (jd_ng1_ng2_adr <= 0.6 and jd_ng1_ng2_name <= 0.6) 
# cad les names sont proches pour la jaccard distance item based
# et les adresses sont proches pour la jaccard distance item based.
# et en plus ils se trouvent dans la même ville atlanta (blocking method)

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [88]:
# les couples de restos en double mais qui ne sont pas détectés par notre algo comme des doubles.
false_negatives.head()

    record_ID_x  record_ID_y      Exist
6            32          759  left_only
9            73          763  left_only
28          179          781  left_only
34          235          786  left_only
56          388          808  left_only

In [89]:
df_restaurants[df_restaurants.record_ID.isin(['2','753'])]
# ce couple est dans le ground_truth car même unique_id 
# mais il n'est pas dans le matches_df, malgré qu' ils ont le même name et la  même adresse (dans l'algo les détecte bien)
# mais le Blocking method ne permet pas à l'algo de les matcher car ils sont considérés ayant des villes différentes :
# 'new york' et 'new york city'  , à cause d'une mauvaise saisie de la ville.

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [90]:
len(bfalse_negatives) # y a beaucoup de false_ngatives par rapport à l'algo dans Blocking method (on avait 13)

58

In [91]:
# false negative
df_restaurants[df_restaurants.record_ID.isin(['26','756'])]
# du au blocking method : new yor et new york city

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [92]:
# false negative
df_restaurants[df_restaurants.record_ID.isin(['32','759'])]
# dû aux matching imprécis de l'algo

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [93]:
# false negative
df_restaurants[df_restaurants.record_ID.isin(['36','760'])]
# du au blocking method : new yor et new york city

Empty DataFrame
Columns: [record_ID, name, address, city, cuisine, unique_id]
Index: []

In [94]:
print(len(ground_truth_matches))
print(len(bmatches_df))
print(len(btrue_positives) , 'true_positives')
print(len(bfalse_positives) ,'false_positives')
print(len(bfalse_negatives)  , 'false_negatives')

# len(true_positives)  +  len(false_negatives) = len(ground_truth_matches)

# len(matches_df)) - len(false_positif) + len(false_negatives)     = ground_truth_matches

112
67
54 true_positives
13 false_positives
58 false_negatives

In [95]:
bprecision = len(btrue_positives)/(len(btrue_positives)+ len(bfalse_positives))
print(bprecision)

0.8059701492537313

In [96]:
brecall = len(btrue_positives)/(len(btrue_positives)+ len(bfalse_negatives))
print(brecall)
# recall faible car y a beaucoup de false negatives
# y a des duplicates que l'algo avec Blocking method n'a pas détecté car saisie à tort dans des villes différentes
# surtout new york et new york city

0.48214285714285715

In [97]:
bf_measure = 2*(bprecision*brecall)/(bprecision+brecall)
print(bf_measure)

0.6033519553072626

### chiffres de l'algo original sans blocking method
### precision: 0.7795

### recall : 0.8839

### f_measure :0.82845